Revit 2026 API

# ElectricalSystemCircuitType Property

---

The circuit type of the Electrical System.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public CircuitType CircuitType { get; }
```
```vb
Public ReadOnly Property CircuitType As CircuitType
	Get
```
```cpp
public:
property CircuitType CircuitType {
	CircuitType get ();
}
```
```fsharp
member CircuitType : CircuitType with get
```

#### Property Value

CircuitType

This read-only property is used to retrieve the circuit type of the Electrical System.

#### Reference

ElectricalSystem Class

Autodesk.Revit.DB.Electrical Namespace